update interactive mode
